lectures/lectures.org
#+TITLE: Языки и методы программирования. Лекции
#+SETUPFILE: https://fniessen.github.io/org-html-themes/org/theme-readtheorg.setup

* Понятия класса, объекта. Инкапсуляция.
** Определения
*Объект (object)* --- самоописывающая структура данных, обладающая внутренними
состояниями и способная обрабатывать передаваемые ей сообщения.

*Инкапсуляция (incapsulation)* --- один из основных принципов ООП, заключающийся
в том, что доступ к внутреннему состоянию объекта осуществляется только через
механизм передачи сообщений.

*Класс (class)* --- тип данных, значениями которого являются объекты, имеющие
сходное внутреннее состояние и обрабатывающие одинаковый набор сообщений.

/Замечание/: объекты являются самоописывающими, так как содержат информацию о
классе, к которому они принадлежат.

/Замечание/: класс можно рассматривать как шаблон для порождения объектов.

/Замечание/: объекты называют также *экземплярами класса* (class instanses).

/Пример/:
#+begin_src java
// Класс Point
(x, y, z) // координаты - это экземплярные поля
get_r(double x, double y, double z) // экземплярный метод
#+end_src

Типы классов:
1. Публичный \\
   Один на файл.
2. Непубличный \\
   В одном файле может быть больше одного.

/Замечание/: файл с исходным кодом описывающим публичный класс, именовывается
так же, как и ~public~ (публичный) класс, с точностью до регистра.

** Структура публичного класса
1. Непубличные классы \\
   Эти классы видны только внутри этого файла (при объявлении
   непубличных классов можно не ставить модификатор ~public~)
2. Члены класса
   - Экземплярные поля \\
     Хранение внутренних состояний объекта.
   - Статические поля \\
     Хранение данных, общих для всех объектов класса.
     Модификатор ~static~.
   - Экземплярные методы \\
     Выполняют обработку передаваемых объекту сообщений.
   - Экземплярные конструкторы \\
     Инициализирует только что созданный объект
     (Метод, который выполняется в момент инициализации объекта).
   - Статический конструктор (набор статических блоков) \\
     Инициализирует статические поля класса.
   - Статический метод \\
     Выполняют действия, для которых не нужен доступ к конкретному объекту
     класса.
   - Вложенные классы \\
     Объекты, необходимые для реализации данного класса.
