lectures/lectures.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-03-06 Sun 00:14 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Языки и методы программирования. Лекции</title>
<meta name="author" content="Starovoytov Alexandr" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">Языки и методы программирования. Лекции</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org8f43089">1. Понятия класса, объекта. Инкапсуляция.</a>
<ul>
<li><a href="#org68ab1a0">1.1. Определения</a></li>
<li><a href="#orge468aeb">1.2. Структура публичного класса</a>
<ul>
<li><a href="#org38a89dc">1.2.1. Примеры</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgde33d39">2. Статические методы, статические поля.</a>
<ul>
<li><a href="#orgf752d8f">2.1. Определения статического поля, экземлярного метода</a></li>
<li><a href="#org430944d">2.2. Виды модификаторов</a></li>
<li><a href="#org6ef7e0e">2.3. Перегрузка методов</a></li>
<li><a href="#org02a7a85">2.4. Статические методы</a></li>
<li><a href="#org452070c">2.5. Статические блоки</a></li>
</ul>
</li>
<li><a href="#org5e57741">3. Статические поля, методы, блоки.</a>
<ul>
<li><a href="#org3153823">3.1. Доступ к статическим полям</a></li>
<li><a href="#org091c8cf">3.2. Пример использования массивов объектов</a></li>
<li><a href="#org5f62a3e">3.3. Перегрузка методов</a></li>
<li><a href="#orgbc9d090">3.4. Виртуальные методы</a></li>
<li><a href="#org7b04735">3.5. Перегрузка экземплярного конструктора</a></li>
</ul>
</li>
<li><a href="#org496b809">4. Наследование, субтипизация</a>
<ul>
<li><a href="#orge955214">4.1. Понятие субтипизации</a></li>
<li><a href="#orgd6c7ec3">4.2. Явная и неявная типизация</a></li>
<li><a href="#orgdcc6e4f">4.3. Наследование как механизм явной субтипизации</a></li>
<li><a href="#org335b614">4.4. Абстрактные классы и интерфейсы</a></li>
<li><a href="#org760e8ad">4.5. Неявное и явное приведение типов</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org8f43089" class="outline-2">
<h2 id="org8f43089"><span class="section-number-2">1.</span> Понятия класса, объекта. Инкапсуляция.</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org68ab1a0" class="outline-3">
<h3 id="org68ab1a0"><span class="section-number-3">1.1.</span> Определения</h3>
<div class="outline-text-3" id="text-1-1">
<p>
<b>Объект (object)</b> &#x2014; самоописывающая структура данных, обладающая внутренними
состояниями и способная обрабатывать передаваемые ей сообщения.
</p>

<p>
<b>Инкапсуляция (incapsulation)</b> &#x2014; один из основных принципов ООП, заключающийся
в том, что доступ к внутреннему состоянию объекта осуществляется только через
механизм передачи сообщений.
</p>

<p>
<b>Класс (class)</b> &#x2014; тип данных, значениями которого являются объекты, имеющие
сходное внутреннее состояние и обрабатывающие одинаковый набор сообщений.
</p>

<p>
<i>Замечание</i>: объекты являются самоописывающими, так как содержат информацию о
классе, к которому они принадлежат.
</p>

<p>
<i>Замечание</i>: класс можно рассматривать как шаблон для порождения объектов.
</p>

<p>
<i>Замечание</i>: объекты называют также <b>экземплярами класса</b> (class instanses).
</p>

<p>
<i>Пример</i>:
</p>
<div class="org-src-container">
<pre class="src src-java"><span style="color: #5B6268;">// </span><span style="color: #5B6268;">&#1050;&#1083;&#1072;&#1089;&#1089; Point</span>
<span style="color: #51afef;">(</span>x, y, z<span style="color: #51afef;">)</span> <span style="color: #5B6268;">// </span><span style="color: #5B6268;">&#1082;&#1086;&#1086;&#1088;&#1076;&#1080;&#1085;&#1072;&#1090;&#1099; - &#1101;&#1090;&#1086; &#1101;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088;&#1085;&#1099;&#1077; &#1087;&#1086;&#1083;&#1103;</span>
get_r<span style="color: #51afef;">(</span><span style="color: #ECBE7B;">double</span> <span style="color: #dcaeea;">x</span>, <span style="color: #ECBE7B;">double</span> <span style="color: #dcaeea;">y</span>, <span style="color: #ECBE7B;">double</span> <span style="color: #dcaeea;">z</span><span style="color: #51afef;">)</span> <span style="color: #5B6268;">// </span><span style="color: #5B6268;">&#1101;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088;&#1085;&#1099;&#1081; &#1084;&#1077;&#1090;&#1086;&#1076;</span>
</pre>
</div>

<p>
Типы классов:
</p>
<ol class="org-ol">
<li>Публичный <br />
Один на файл.</li>
<li>Непубличный <br />
В одном файле может быть больше одного.</li>
</ol>

<p>
<i>Замечание</i>: файл с исходным кодом описывающим публичный класс, именовывается
так же, как и <code>public</code> (публичный) класс, с точностью до регистра.
</p>
</div>
</div>

<div id="outline-container-orge468aeb" class="outline-3">
<h3 id="orge468aeb"><span class="section-number-3">1.2.</span> Структура публичного класса</h3>
<div class="outline-text-3" id="text-1-2">
<ol class="org-ol">
<li>Непубличные классы <br />
Эти классы видны только внутри этого файла (при объявлении
непубличных классов можно не ставить модификатор <code>public</code>)</li>
<li>Члены класса
<ul class="org-ul">
<li>Экземплярные поля <br />
Хранение внутренних состояний объекта.</li>
<li>Статические поля <br />
Хранение данных, общих для всех объектов класса.
Модификатор <code>static</code>.</li>
<li>Экземплярные методы <br />
Выполняют обработку передаваемых объекту сообщений.</li>
<li>Экземплярные конструкторы <br />
Инициализирует только что созданный объект
(Метод, который выполняется в момент инициализации объекта).</li>
<li>Статический конструктор (набор статических блоков) <br />
Инициализирует статические поля класса.</li>
<li>Статический метод <br />
Выполняют действия, для которых не нужен доступ к конкретному объекту
класса.</li>
<li>Вложенные классы <br />
Объекты, необходимые для реализации данного класса.</li>
</ul></li>
</ol>
</div>
