lectures/lectures.org
*** Примеры
1. Не нарушаем принцип инкапсуляции
   - ~Main.java~:
     #+begin_src java
   public class Main {
       public static void main(String[] args) {
           Point A = new Point("Tochka A");
           A.setCoords(1.0, 1.0, 34.0);
       }
   }
     #+end_src
   - ~Point.java~:
     #+begin_src java
   public class Point {
       private double x;
       private double y;
       private double z;
       public Point(String Name) { // конструктор
           this.name = Name;
       }
       public void setCoords(double inX, double inY, double inZ) {
           this.x = inX;
           this.y = inY;
           this.z = inZ;
       }
   }
     #+end_src
2. Нарушаем
   - ~Main.java~:
     #+begin_src java
   public class Main {
       public static void main(String[] args) {
           Point A = new Point("Tochka A");
           A.x = 1.0;
           A.y = 1.0;
           A.z = 34.0;
       }
   }
     #+end_src
   - ~Point.java~:
     #+begin_src java
   public class Point {
       public double x;
       public double y;
       public double z;
       public Point(String Name) { // конструктор
           this.name = Name;
       }
   }
     #+end_src
* Статические методы, статические поля.
** Определения статического поля, экземлярного метода
*Статическое поле (static field)* --- это такое поле, принадлежащее некотрому
классу, значение которого разделяется всеми объектами этого класса.

/Пример/:
#+begin_src java
class Point {
    public int x, y; // координаты точки
    public static int count; // общее количество точек
};
#+end_src

*Экземплярный метод (instance method)* --- подпрограмма (функция),
осуществляющая обработку переданного объекту сообщения.

- /Экземплярный метод/ передает объекту сообщения.
- /Экземплярный метод/ имеет доступ к внутреннему состоянию объекта (может
  читать/изменять значения экземплярных полей).

/Пример/:
#+begin_src java
class Person {
    public String name;
    public int yearOfBirth;
    private String address;
};
#+end_src
~name~, ~yearOfBirth~, ~address~ --- экземплярные поля.
~public~, ~private~ --- модификаторы.

** Виды модификаторов
1. ~private~ \\
   Доступ разрешен только из тела класса.
2. Без модификатора \\
   Доступ разрешен для самого класса и классов из того же пакета.
3. ~protected~ \\
   Доступ разрешен для самого класса, для классов из того же пакета, а также
   наследников класса.
4. ~public~ \\
   Доступ возможен откуда угодно.
