lectures/lectures.html
<div id="outline-container-org38a89dc" class="outline-4">
<h4 id="org38a89dc"><span class="section-number-4">1.2.1.</span> Примеры</h4>
<div class="outline-text-4" id="text-1-2-1">
<ol class="org-ol">
<li>Не нарушаем принцип инкапсуляции
<ul class="org-ul">
<li><p>
<code>Main.java</code>:
</p>
<div class="org-src-container">
<pre class="src src-java">   <span style="color: #51afef;">public</span> <span style="color: #51afef;">class</span> <span style="color: #ECBE7B;">Main</span> <span style="color: #51afef;">{</span>
       <span style="color: #51afef;">public</span> <span style="color: #51afef;">static</span> <span style="color: #ECBE7B;">void</span> <span style="color: #c678dd;">main</span><span style="color: #c678dd;">(</span><span style="color: #ECBE7B;">String</span><span style="color: #98be65;">[]</span> <span style="color: #dcaeea;">args</span><span style="color: #c678dd;">)</span> <span style="color: #c678dd;">{</span>
           <span style="color: #ECBE7B;">Point</span> <span style="color: #dcaeea;">A</span> = <span style="color: #51afef;">new</span> <span style="color: #ECBE7B;">Point</span><span style="color: #98be65;">(</span><span style="color: #98be65;">"Tochka A"</span><span style="color: #98be65;">)</span>;
           A.setCoords<span style="color: #98be65;">(</span><span style="color: #da8548; font-weight: bold;">1.0</span>, <span style="color: #da8548; font-weight: bold;">1.0</span>, <span style="color: #da8548; font-weight: bold;">34.0</span><span style="color: #98be65;">)</span>;
       <span style="color: #c678dd;">}</span>
   <span style="color: #51afef;">}</span>
</pre>
</div></li>
<li><p>
<code>Point.java</code>:
</p>
<div class="org-src-container">
<pre class="src src-java">   <span style="color: #51afef;">public</span> <span style="color: #51afef;">class</span> <span style="color: #ECBE7B;">Point</span> <span style="color: #51afef;">{</span>
       <span style="color: #51afef;">private</span> <span style="color: #ECBE7B;">double</span> <span style="color: #dcaeea;">x</span>;
       <span style="color: #51afef;">private</span> <span style="color: #ECBE7B;">double</span> <span style="color: #dcaeea;">y</span>;
       <span style="color: #51afef;">private</span> <span style="color: #ECBE7B;">double</span> <span style="color: #dcaeea;">z</span>;
       <span style="color: #51afef;">public</span> <span style="color: #c678dd;">Point</span><span style="color: #c678dd;">(</span><span style="color: #ECBE7B;">String</span> <span style="color: #dcaeea;">Name</span><span style="color: #c678dd;">)</span> <span style="color: #c678dd;">{</span> <span style="color: #5B6268;">// </span><span style="color: #5B6268;">&#1082;&#1086;&#1085;&#1089;&#1090;&#1088;&#1091;&#1082;&#1090;&#1086;&#1088;</span>
           <span style="color: #51afef;">this</span>.name = Name;
       <span style="color: #c678dd;">}</span>
       <span style="color: #51afef;">public</span> <span style="color: #ECBE7B;">void</span> <span style="color: #c678dd;">setCoords</span><span style="color: #c678dd;">(</span><span style="color: #ECBE7B;">double</span> <span style="color: #dcaeea;">inX</span>, <span style="color: #ECBE7B;">double</span> <span style="color: #dcaeea;">inY</span>, <span style="color: #ECBE7B;">double</span> <span style="color: #dcaeea;">inZ</span><span style="color: #c678dd;">)</span> <span style="color: #c678dd;">{</span>
           <span style="color: #51afef;">this</span>.x = inX;
           <span style="color: #51afef;">this</span>.y = inY;
           <span style="color: #51afef;">this</span>.z = inZ;
       <span style="color: #c678dd;">}</span>
   <span style="color: #51afef;">}</span>
</pre>
</div></li>
</ul></li>
<li>Нарушаем
<ul class="org-ul">
<li><p>
<code>Main.java</code>:
</p>
<div class="org-src-container">
<pre class="src src-java">   <span style="color: #51afef;">public</span> <span style="color: #51afef;">class</span> <span style="color: #ECBE7B;">Main</span> <span style="color: #51afef;">{</span>
       <span style="color: #51afef;">public</span> <span style="color: #51afef;">static</span> <span style="color: #ECBE7B;">void</span> <span style="color: #c678dd;">main</span><span style="color: #c678dd;">(</span><span style="color: #ECBE7B;">String</span><span style="color: #98be65;">[]</span> <span style="color: #dcaeea;">args</span><span style="color: #c678dd;">)</span> <span style="color: #c678dd;">{</span>
           <span style="color: #ECBE7B;">Point</span> <span style="color: #dcaeea;">A</span> = <span style="color: #51afef;">new</span> <span style="color: #ECBE7B;">Point</span><span style="color: #98be65;">(</span><span style="color: #98be65;">"Tochka A"</span><span style="color: #98be65;">)</span>;
           A.x = <span style="color: #da8548; font-weight: bold;">1.0</span>;
           A.y = <span style="color: #da8548; font-weight: bold;">1.0</span>;
           A.z = <span style="color: #da8548; font-weight: bold;">34.0</span>;
       <span style="color: #c678dd;">}</span>
   <span style="color: #51afef;">}</span>
</pre>
</div></li>
<li><p>
<code>Point.java</code>:
</p>
<div class="org-src-container">
<pre class="src src-java">   <span style="color: #51afef;">public</span> <span style="color: #51afef;">class</span> <span style="color: #ECBE7B;">Point</span> <span style="color: #51afef;">{</span>
       <span style="color: #51afef;">public</span> <span style="color: #ECBE7B;">double</span> <span style="color: #dcaeea;">x</span>;
       <span style="color: #51afef;">public</span> <span style="color: #ECBE7B;">double</span> <span style="color: #dcaeea;">y</span>;
       <span style="color: #51afef;">public</span> <span style="color: #ECBE7B;">double</span> <span style="color: #dcaeea;">z</span>;
       <span style="color: #51afef;">public</span> <span style="color: #c678dd;">Point</span><span style="color: #c678dd;">(</span><span style="color: #ECBE7B;">String</span> <span style="color: #dcaeea;">Name</span><span style="color: #c678dd;">)</span> <span style="color: #c678dd;">{</span> <span style="color: #5B6268;">// </span><span style="color: #5B6268;">&#1082;&#1086;&#1085;&#1089;&#1090;&#1088;&#1091;&#1082;&#1090;&#1086;&#1088;</span>
           <span style="color: #51afef;">this</span>.name = Name;
       <span style="color: #c678dd;">}</span>
   <span style="color: #51afef;">}</span>
</pre>
</div></li>
</ul></li>
</ol>
</div>
</div>
</div>
</div>
<div id="outline-container-orgde33d39" class="outline-2">
<h2 id="orgde33d39"><span class="section-number-2">2.</span> Статические методы, статические поля.</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-orgf752d8f" class="outline-3">
<h3 id="orgf752d8f"><span class="section-number-3">2.1.</span> Определения статического поля, экземлярного метода</h3>
<div class="outline-text-3" id="text-2-1">
<p>
<b>Статическое поле (static field)</b> &#x2014; это такое поле, принадлежащее некотрому
классу, значение которого разделяется всеми объектами этого класса.
</p>

<p>
<i>Пример</i>:
</p>
<div class="org-src-container">
<pre class="src src-java"><span style="color: #51afef;">class</span> <span style="color: #ECBE7B;">Point</span> <span style="color: #51afef;">{</span>
    <span style="color: #51afef;">public</span> <span style="color: #ECBE7B;">int</span> <span style="color: #dcaeea;">x</span>, <span style="color: #dcaeea;">y</span>; <span style="color: #5B6268;">// </span><span style="color: #5B6268;">&#1082;&#1086;&#1086;&#1088;&#1076;&#1080;&#1085;&#1072;&#1090;&#1099; &#1090;&#1086;&#1095;&#1082;&#1080;</span>
    <span style="color: #51afef;">public</span> <span style="color: #51afef;">static</span> <span style="color: #ECBE7B;">int</span> <span style="color: #dcaeea;">count</span>; <span style="color: #5B6268;">// </span><span style="color: #5B6268;">&#1086;&#1073;&#1097;&#1077;&#1077; &#1082;&#1086;&#1083;&#1080;&#1095;&#1077;&#1089;&#1090;&#1074;&#1086; &#1090;&#1086;&#1095;&#1077;&#1082;</span>
<span style="color: #51afef;">}</span>;
</pre>
</div>

<p>
<b>Экземплярный метод (instance method)</b> &#x2014; подпрограмма (функция),
осуществляющая обработку переданного объекту сообщения.
</p>

<ul class="org-ul">
<li><i>Экземплярный метод</i> передает объекту сообщения.</li>
<li><i>Экземплярный метод</i> имеет доступ к внутреннему состоянию объекта (может
читать/изменять значения экземплярных полей).</li>
</ul>

<p>
<i>Пример</i>:
</p>
<div class="org-src-container">
<pre class="src src-java"><span style="color: #51afef;">class</span> <span style="color: #ECBE7B;">Person</span> <span style="color: #51afef;">{</span>
    <span style="color: #51afef;">public</span> <span style="color: #ECBE7B;">String</span> <span style="color: #dcaeea;">name</span>;
    <span style="color: #51afef;">public</span> <span style="color: #ECBE7B;">int</span> <span style="color: #dcaeea;">yearOfBirth</span>;
    <span style="color: #51afef;">private</span> <span style="color: #ECBE7B;">String</span> <span style="color: #dcaeea;">address</span>;
<span style="color: #51afef;">}</span>;
</pre>
</div>
<p>
<code>name</code>, <code>yearOfBirth</code>, <code>address</code> &#x2014; экземплярные поля.
<code>public</code>, <code>private</code> &#x2014; модификаторы.
</p>
</div>
</div>

<div id="outline-container-org430944d" class="outline-3">
<h3 id="org430944d"><span class="section-number-3">2.2.</span> Виды модификаторов</h3>
<div class="outline-text-3" id="text-2-2">
<ol class="org-ol">
<li><code>private</code> <br />
Доступ разрешен только из тела класса.</li>
<li>Без модификатора <br />
Доступ разрешен для самого класса и классов из того же пакета.</li>
<li><code>protected</code> <br />
Доступ разрешен для самого класса, для классов из того же пакета, а также
наследников класса.</li>
<li><code>public</code> <br />
Доступ возможен откуда угодно.</li>
</ol>
</div>
</div>
