lectures/lectures.org
** Перегрузка методов
Конструктор не указан. Создается конструктор по умолчанию:
#+begin_src java
public class Cat {
    public String name;
    public int age;
};
#+end_src

Явно указан конструктор по умолчанию:
#+begin_src java
public class Cat {
    public String name;
    public int age;
    public Cat() {}
};
#+end_src

Перегрузка конструктора:
#+begin_src java
public class Cat {
    public String name;
    public int age;
    public Cat(String name, int age) {
        this.name = name;
        this.age = age;
    }
    public Cat() {}
};
#+end_src
~String name, int age~ --- *структура метода* (method structure).

/Примеры/ создания объекта класса ~Cat~:
#+begin_src java
Cat A = new Cat();
Cat B = new Cat("Meow", 5);
#+end_src

** Статические методы
*Статический метод (static method)* --- метод, не имеющий доступа к внутреннему
состоянию этого объекта. Другими словами, статический метод может обратиться
только к статическим переменным и методам.

~private static~ vs ~public static~:
- =public static= \\
  Статическое поле можно определить через любой объект класса или имя класса.
- =private static= \\
  Можно определить только внутри класса.

/Примеры/:
#+begin_src java
public class Point {
    private double x;
    private double y;
    private static int n;
    public static int val;
    public Point() {
        this.n = 10;
        this.val = 100;
    }
    public void setCoords(double varX, double varY) {
        this.x = varX;
        this.y = varY;
    }
    public double getN() {
        return this.n;
    }
    public void setN() {
        this.n = 100;
    }
};
#+end_src
#+begin_src java
public class Main {
    public static void main(String[] args) {
       Point PointA = new Point(); // n = 10, val = 100
        PointA.n = 242; // ошибка, т.к. поле private
        Point.n = 100; // ошибка, т.к. поле private
        Point.val = 200; // верно, обращение к static полю через имя класса
        // n = 10, val = 100

        Point PointB = new Point(); // n = 10, val = 100
        PointA.setN(); // n = 100, val = 100
    }
};
#+end_src

** Статические блоки
*Статический блок (static-блоки)* --- код, расположенный в статическом блоке,
 будет выполнен во время запуска программы, или при первой загрузке класса, еще
 до того, как этот класс будет использоваться в программе (т.е. до создания его
 экземляров, вызова статических методов и обращения к ним и т.д.).
#+begin_src java
public class A {
    static Date timeStart; // время запуска программы
    Date timeStartObj; // время инициализации объекта
    static {
        timeStart = new Date();
    }
    public A() {
        timeStartObj = new Date();
    }
};
#+end_src
#+begin_src java
public class Main {
    public static void main(String[] args) {
        A a = new A(); // timeStart != timeStartObj
    }
};
#+end_src
* Статические поля, методы, блоки.
