lectures/lectures.html
<div id="outline-container-org6ef7e0e" class="outline-3">
<h3 id="org6ef7e0e"><span class="section-number-3">2.3.</span> Перегрузка методов</h3>
<div class="outline-text-3" id="text-2-3">
<p>
Конструктор не указан. Создается конструктор по умолчанию:
</p>
<div class="org-src-container">
<pre class="src src-java"><span style="color: #51afef;">public</span> <span style="color: #51afef;">class</span> <span style="color: #ECBE7B;">Cat</span> <span style="color: #51afef;">{</span>
    <span style="color: #51afef;">public</span> <span style="color: #ECBE7B;">String</span> <span style="color: #dcaeea;">name</span>;
    <span style="color: #51afef;">public</span> <span style="color: #ECBE7B;">int</span> <span style="color: #dcaeea;">age</span>;
<span style="color: #51afef;">}</span>;
</pre>
</div>

<p>
Явно указан конструктор по умолчанию:
</p>
<div class="org-src-container">
<pre class="src src-java"><span style="color: #51afef;">public</span> <span style="color: #51afef;">class</span> <span style="color: #ECBE7B;">Cat</span> <span style="color: #51afef;">{</span>
    <span style="color: #51afef;">public</span> <span style="color: #ECBE7B;">String</span> <span style="color: #dcaeea;">name</span>;
    <span style="color: #51afef;">public</span> <span style="color: #ECBE7B;">int</span> <span style="color: #dcaeea;">age</span>;
    <span style="color: #51afef;">public</span> <span style="color: #c678dd;">Cat</span><span style="color: #c678dd;">()</span> <span style="color: #c678dd;">{}</span>
<span style="color: #51afef;">}</span>;
</pre>
</div>

<p>
Перегрузка конструктора:
</p>
<div class="org-src-container">
<pre class="src src-java"><span style="color: #51afef;">public</span> <span style="color: #51afef;">class</span> <span style="color: #ECBE7B;">Cat</span> <span style="color: #51afef;">{</span>
    <span style="color: #51afef;">public</span> <span style="color: #ECBE7B;">String</span> <span style="color: #dcaeea;">name</span>;
    <span style="color: #51afef;">public</span> <span style="color: #ECBE7B;">int</span> <span style="color: #dcaeea;">age</span>;
    <span style="color: #51afef;">public</span> <span style="color: #c678dd;">Cat</span><span style="color: #c678dd;">(</span><span style="color: #ECBE7B;">String</span> <span style="color: #dcaeea;">name</span>, <span style="color: #ECBE7B;">int</span> <span style="color: #dcaeea;">age</span><span style="color: #c678dd;">)</span> <span style="color: #c678dd;">{</span>
        <span style="color: #51afef;">this</span>.name = name;
        <span style="color: #51afef;">this</span>.age = age;
    <span style="color: #c678dd;">}</span>
    <span style="color: #51afef;">public</span> <span style="color: #c678dd;">Cat</span><span style="color: #c678dd;">()</span> <span style="color: #c678dd;">{}</span>
<span style="color: #51afef;">}</span>;
</pre>
</div>
<p>
<code>String name, int age</code> &#x2014; <b>структура метода</b> (method structure).
</p>

<p>
<i>Примеры</i> создания объекта класса <code>Cat</code>:
</p>
<div class="org-src-container">
<pre class="src src-java"><span style="color: #ECBE7B;">Cat</span> <span style="color: #dcaeea;">A</span> = <span style="color: #51afef;">new</span> <span style="color: #ECBE7B;">Cat</span><span style="color: #51afef;">()</span>;
<span style="color: #ECBE7B;">Cat</span> <span style="color: #dcaeea;">B</span> = <span style="color: #51afef;">new</span> <span style="color: #ECBE7B;">Cat</span><span style="color: #51afef;">(</span><span style="color: #98be65;">"Meow"</span>, <span style="color: #da8548; font-weight: bold;">5</span><span style="color: #51afef;">)</span>;
</pre>
</div>
</div>
</div>

<div id="outline-container-org02a7a85" class="outline-3">
<h3 id="org02a7a85"><span class="section-number-3">2.4.</span> Статические методы</h3>
<div class="outline-text-3" id="text-2-4">
<p>
<b>Статический метод (static method)</b> &#x2014; метод, не имеющий доступа к внутреннему
состоянию этого объекта. Другими словами, статический метод может обратиться
только к статическим переменным и методам.
</p>

<p>
<code>private static</code> vs <code>public static</code>:
</p>
<ul class="org-ul">
<li><code>public static</code> <br />
Статическое поле можно определить через любой объект класса или имя класса.</li>
<li><code>private static</code> <br />
Можно определить только внутри класса.</li>
</ul>

<p>
<i>Примеры</i>:
</p>
<div class="org-src-container">
<pre class="src src-java"><span style="color: #51afef;">public</span> <span style="color: #51afef;">class</span> <span style="color: #ECBE7B;">Point</span> <span style="color: #51afef;">{</span>
    <span style="color: #51afef;">private</span> <span style="color: #ECBE7B;">double</span> <span style="color: #dcaeea;">x</span>;
    <span style="color: #51afef;">private</span> <span style="color: #ECBE7B;">double</span> <span style="color: #dcaeea;">y</span>;
    <span style="color: #51afef;">private</span> <span style="color: #51afef;">static</span> <span style="color: #ECBE7B;">int</span> <span style="color: #dcaeea;">n</span>;
    <span style="color: #51afef;">public</span> <span style="color: #51afef;">static</span> <span style="color: #ECBE7B;">int</span> <span style="color: #dcaeea;">val</span>;
    <span style="color: #51afef;">public</span> <span style="color: #c678dd;">Point</span><span style="color: #c678dd;">()</span> <span style="color: #c678dd;">{</span>
        <span style="color: #51afef;">this</span>.n = <span style="color: #da8548; font-weight: bold;">10</span>;
        <span style="color: #51afef;">this</span>.val = <span style="color: #da8548; font-weight: bold;">100</span>;
    <span style="color: #c678dd;">}</span>
    <span style="color: #51afef;">public</span> <span style="color: #ECBE7B;">void</span> <span style="color: #c678dd;">setCoords</span><span style="color: #c678dd;">(</span><span style="color: #ECBE7B;">double</span> <span style="color: #dcaeea;">varX</span>, <span style="color: #ECBE7B;">double</span> <span style="color: #dcaeea;">varY</span><span style="color: #c678dd;">)</span> <span style="color: #c678dd;">{</span>
        <span style="color: #51afef;">this</span>.x = varX;
        <span style="color: #51afef;">this</span>.y = varY;
    <span style="color: #c678dd;">}</span>
    <span style="color: #51afef;">public</span> <span style="color: #ECBE7B;">double</span> <span style="color: #c678dd;">getN</span><span style="color: #c678dd;">()</span> <span style="color: #c678dd;">{</span>
        <span style="color: #51afef;">return</span> <span style="color: #51afef;">this</span>.n;
    <span style="color: #c678dd;">}</span>
    <span style="color: #51afef;">public</span> <span style="color: #ECBE7B;">void</span> <span style="color: #c678dd;">setN</span><span style="color: #c678dd;">()</span> <span style="color: #c678dd;">{</span>
        <span style="color: #51afef;">this</span>.n = <span style="color: #da8548; font-weight: bold;">100</span>;
    <span style="color: #c678dd;">}</span>
<span style="color: #51afef;">}</span>;
</pre>
</div>
<div class="org-src-container">
<pre class="src src-java"><span style="color: #51afef;">public</span> <span style="color: #51afef;">class</span> <span style="color: #ECBE7B;">Main</span> <span style="color: #51afef;">{</span>
    <span style="color: #51afef;">public</span> <span style="color: #51afef;">static</span> <span style="color: #ECBE7B;">void</span> <span style="color: #c678dd;">main</span><span style="color: #c678dd;">(</span><span style="color: #ECBE7B;">String</span><span style="color: #98be65;">[]</span> <span style="color: #dcaeea;">args</span><span style="color: #c678dd;">)</span> <span style="color: #c678dd;">{</span>
       <span style="color: #ECBE7B;">Point</span> <span style="color: #dcaeea;">PointA</span> = <span style="color: #51afef;">new</span> <span style="color: #ECBE7B;">Point</span><span style="color: #98be65;">()</span>; <span style="color: #5B6268;">// </span><span style="color: #5B6268;">n = 10, val = 100</span>
        PointA.n = <span style="color: #da8548; font-weight: bold;">242</span>; <span style="color: #5B6268;">// </span><span style="color: #5B6268;">&#1086;&#1096;&#1080;&#1073;&#1082;&#1072;, &#1090;.&#1082;. &#1087;&#1086;&#1083;&#1077; private</span>
        Point.n = <span style="color: #da8548; font-weight: bold;">100</span>; <span style="color: #5B6268;">// </span><span style="color: #5B6268;">&#1086;&#1096;&#1080;&#1073;&#1082;&#1072;, &#1090;.&#1082;. &#1087;&#1086;&#1083;&#1077; private</span>
        Point.val = <span style="color: #da8548; font-weight: bold;">200</span>; <span style="color: #5B6268;">// </span><span style="color: #5B6268;">&#1074;&#1077;&#1088;&#1085;&#1086;, &#1086;&#1073;&#1088;&#1072;&#1097;&#1077;&#1085;&#1080;&#1077; &#1082; static &#1087;&#1086;&#1083;&#1102; &#1095;&#1077;&#1088;&#1077;&#1079; &#1080;&#1084;&#1103; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072;</span>
        <span style="color: #5B6268;">// </span><span style="color: #5B6268;">n = 10, val = 100</span>

        <span style="color: #ECBE7B;">Point</span> <span style="color: #dcaeea;">PointB</span> = <span style="color: #51afef;">new</span> <span style="color: #ECBE7B;">Point</span><span style="color: #98be65;">()</span>; <span style="color: #5B6268;">// </span><span style="color: #5B6268;">n = 10, val = 100</span>
        PointA.setN<span style="color: #98be65;">()</span>; <span style="color: #5B6268;">// </span><span style="color: #5B6268;">n = 100, val = 100</span>
    <span style="color: #c678dd;">}</span>
<span style="color: #51afef;">}</span>;
</pre>
</div>
</div>
</div>

<div id="outline-container-org452070c" class="outline-3">
<h3 id="org452070c"><span class="section-number-3">2.5.</span> Статические блоки</h3>
<div class="outline-text-3" id="text-2-5">
<p>
<b>Статический блок (static-блоки)</b> &#x2014; код, расположенный в статическом блоке,
 будет выполнен во время запуска программы, или при первой загрузке класса, еще
 до того, как этот класс будет использоваться в программе (т.е. до создания его
 экземляров, вызова статических методов и обращения к ним и т.д.).
</p>
<div class="org-src-container">
<pre class="src src-java"><span style="color: #51afef;">public</span> <span style="color: #51afef;">class</span> <span style="color: #ECBE7B;">A</span> <span style="color: #51afef;">{</span>
    <span style="color: #51afef;">static</span> <span style="color: #ECBE7B;">Date</span> <span style="color: #dcaeea;">timeStart</span>; <span style="color: #5B6268;">// </span><span style="color: #5B6268;">&#1074;&#1088;&#1077;&#1084;&#1103; &#1079;&#1072;&#1087;&#1091;&#1089;&#1082;&#1072; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1099;</span>
    <span style="color: #ECBE7B;">Date</span> <span style="color: #dcaeea;">timeStartObj</span>; <span style="color: #5B6268;">// </span><span style="color: #5B6268;">&#1074;&#1088;&#1077;&#1084;&#1103; &#1080;&#1085;&#1080;&#1094;&#1080;&#1072;&#1083;&#1080;&#1079;&#1072;&#1094;&#1080;&#1080; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1072;</span>
    <span style="color: #51afef;">static</span> <span style="color: #c678dd;">{</span>
        timeStart = <span style="color: #51afef;">new</span> <span style="color: #ECBE7B;">Date</span><span style="color: #98be65;">()</span>;
    <span style="color: #c678dd;">}</span>
    <span style="color: #51afef;">public</span> <span style="color: #c678dd;">A</span><span style="color: #c678dd;">()</span> <span style="color: #c678dd;">{</span>
        timeStartObj = <span style="color: #51afef;">new</span> <span style="color: #ECBE7B;">Date</span><span style="color: #98be65;">()</span>;
    <span style="color: #c678dd;">}</span>
<span style="color: #51afef;">}</span>;
</pre>
</div>
<div class="org-src-container">
<pre class="src src-java"><span style="color: #51afef;">public</span> <span style="color: #51afef;">class</span> <span style="color: #ECBE7B;">Main</span> <span style="color: #51afef;">{</span>
    <span style="color: #51afef;">public</span> <span style="color: #51afef;">static</span> <span style="color: #ECBE7B;">void</span> <span style="color: #c678dd;">main</span><span style="color: #c678dd;">(</span><span style="color: #ECBE7B;">String</span><span style="color: #98be65;">[]</span> <span style="color: #dcaeea;">args</span><span style="color: #c678dd;">)</span> <span style="color: #c678dd;">{</span>
        <span style="color: #ECBE7B;">A</span> <span style="color: #dcaeea;">a</span> = <span style="color: #51afef;">new</span> <span style="color: #ECBE7B;">A</span><span style="color: #98be65;">()</span>; <span style="color: #5B6268;">// </span><span style="color: #5B6268;">timeStart != timeStartObj</span>
    <span style="color: #c678dd;">}</span>
<span style="color: #51afef;">}</span>;
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org5e57741" class="outline-2">
<h2 id="org5e57741"><span class="section-number-2">3.</span> Статические поля, методы, блоки.</h2>
<div class="outline-text-2" id="text-3">
</div>
