lectures/lectures.org
** Доступ к статическим полям
*Утверждение*: если экземплярное поле является статичным, то это значение
глобально для всех объектов.

*Утверждение*: статический метод может обратиться только к статическим
переменным. => любой статический метод не имеет доступа к внутреннему состоянию
объектов этого класса.

/Пример/:
#+begin_src java
public class Point {
    // ... объявления полей
    private static double y;
    // ...

    public static void setY(double varY) {
        y = varY; // this.y = varY - нельзя
    }
};
#+end_src

** Пример использования массивов объектов
#+begin_src java
public class Main {
    public static void main(String[] args) {
        // Объекты класса Point
        Point A = new Point("A", 5, 4);
        Point B = new Point("B", 100, 100);

        // Определение массива объектов из 100 элементов
        Point[] points = new Point[100];
        //      ~~~~~~ - имя массива объектов
        points[0] = new Point("AA", 2, 1);
        points[1] = new Point("BB", 34, 48);
        // ...
    }
};
#+end_src

/Замечание/: если в объявлении класса содержится несколько статических блоков,
то код в них выполняется последовательно.

/Замечание/: совокупность всех ~static~-блоков играет роль статического
конструктора.

** Перегрузка методов
*Сигнатура метода (method signature)* --- информация о количестве и типах
формальных параметров в методе.

/Замечание/: если у метода нет формальных параметров, то говорят, что у метода
пустая сигнатура.

*Перегрузка метода (method overloading)* --- это объявление для заданного класса
двух или более методов, имеющих одинаковое имя, но различные сигнатуры.

/Замечание/: решение о том, куда передается управление при вызове перегруженного
метода X, принимается на этапе компиляции на основе сопоставления типов
фактических параметров вызываемого метода и сигнатуры, имеющей имя X.

** Виртуальные методы
*Раннее связывание (early binding)* --- определение адреса вызываемого
экземлярного метода во время компиляции программы.

*Позднее связывание (late binding)* --- определение адреса вызываемого
экземлярного метода на основе информации о классе объекта во время выполнения
программы.

*Виртуальные экземплярные методы* -- экземплярные методы, для вызова которых
выполняется позднее связывание называются *виртуальными*.

/Замечание/: в языке ~Java~ все методы являются *виртуальными*.

/Выводы/:
1. Все методы в ~Java~ виртуальные, следовательно, для любых методов выполняется
   позднее связывание.
2. В ~Java~ метод класса может быть определен в классах-наследниках так, что
   конкретная реализация метода для вызова будет определяться во время
   исполнения.
3. Таким образом, программисту не обязательно знать точный тип объекта для
   работы с ним через виртуальные методы: достаточно знать, что объект
   принадлежит классу или наследнику класса, в котором объявлен метод.

** Перегрузка экземплярного конструктора
*Экземплярный конструктор (instance constructor)* --- экземплярный метод,
предназначенный для инициализации только что созданного объекта.

/Замечание/: в ~Java~ и других объектно-ориентированных языках программирования
операция создания объекта объединена с вызовом конструктора, что гарантирует
отсутствие неинициализированных объектов.

/Замечание/: перегрузка конструктора осуществляется аналогично перегрузке
методов, поскольку конструктор это такой же метод.

*Конструктор по умолчанию (default constructor)* --- экземплярный конструктор с
пустой сигнатурой.

/Замечание/: во всех языка программирования конструктор по умолчанию всегда
создается даже если для класса не определен ни один конструктор.

*Статический конструктор (static constructor)* --- статический метод,
предназначенный для инициализации статических полей класса. Статический
конструктор не имеет параметров и вызывается до вызова любого статического
метода или конструктора класса.

/Замечание/: в ~Java~ нет статических конструкторов, т.к. конструктор по
определению не может быть статическим. Не может существовать конструктора для
класса, т.к. класс не является его экземпляром.
* Наследование, субтипизация
