lectures/lectures.html
<div id="outline-container-org3153823" class="outline-3">
<h3 id="org3153823"><span class="section-number-3">3.1.</span> Доступ к статическим полям</h3>
<div class="outline-text-3" id="text-3-1">
<p>
<b>Утверждение</b>: если экземплярное поле является статичным, то это значение
глобально для всех объектов.
</p>

<p>
<b>Утверждение</b>: статический метод может обратиться только к статическим
переменным. =&gt; любой статический метод не имеет доступа к внутреннему состоянию
объектов этого класса.
</p>

<p>
<i>Пример</i>:
</p>
<div class="org-src-container">
<pre class="src src-java"><span style="color: #51afef;">public</span> <span style="color: #51afef;">class</span> <span style="color: #ECBE7B;">Point</span> <span style="color: #51afef;">{</span>
    <span style="color: #5B6268;">// </span><span style="color: #5B6268;">... &#1086;&#1073;&#1098;&#1103;&#1074;&#1083;&#1077;&#1085;&#1080;&#1103; &#1087;&#1086;&#1083;&#1077;&#1081;</span>
    <span style="color: #51afef;">private</span> <span style="color: #51afef;">static</span> <span style="color: #ECBE7B;">double</span> <span style="color: #dcaeea;">y</span>;
    <span style="color: #5B6268;">// </span><span style="color: #5B6268;">...</span>

    <span style="color: #51afef;">public</span> <span style="color: #51afef;">static</span> <span style="color: #ECBE7B;">void</span> <span style="color: #c678dd;">setY</span><span style="color: #c678dd;">(</span><span style="color: #ECBE7B;">double</span> <span style="color: #dcaeea;">varY</span><span style="color: #c678dd;">)</span> <span style="color: #c678dd;">{</span>
        y = varY; <span style="color: #5B6268;">// </span><span style="color: #5B6268;">this.y = varY - &#1085;&#1077;&#1083;&#1100;&#1079;&#1103;</span>
    <span style="color: #c678dd;">}</span>
<span style="color: #51afef;">}</span>;
</pre>
</div>
</div>
</div>

<div id="outline-container-org091c8cf" class="outline-3">
<h3 id="org091c8cf"><span class="section-number-3">3.2.</span> Пример использования массивов объектов</h3>
<div class="outline-text-3" id="text-3-2">
<div class="org-src-container">
<pre class="src src-java"><span style="color: #51afef;">public</span> <span style="color: #51afef;">class</span> <span style="color: #ECBE7B;">Main</span> <span style="color: #51afef;">{</span>
    <span style="color: #51afef;">public</span> <span style="color: #51afef;">static</span> <span style="color: #ECBE7B;">void</span> <span style="color: #c678dd;">main</span><span style="color: #c678dd;">(</span><span style="color: #ECBE7B;">String</span><span style="color: #98be65;">[]</span> <span style="color: #dcaeea;">args</span><span style="color: #c678dd;">)</span> <span style="color: #c678dd;">{</span>
        <span style="color: #5B6268;">// </span><span style="color: #5B6268;">&#1054;&#1073;&#1098;&#1077;&#1082;&#1090;&#1099; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; Point</span>
        <span style="color: #ECBE7B;">Point</span> <span style="color: #dcaeea;">A</span> = <span style="color: #51afef;">new</span> <span style="color: #ECBE7B;">Point</span><span style="color: #98be65;">(</span><span style="color: #98be65;">"A"</span>, <span style="color: #da8548; font-weight: bold;">5</span>, <span style="color: #da8548; font-weight: bold;">4</span><span style="color: #98be65;">)</span>;
        <span style="color: #ECBE7B;">Point</span> <span style="color: #dcaeea;">B</span> = <span style="color: #51afef;">new</span> <span style="color: #ECBE7B;">Point</span><span style="color: #98be65;">(</span><span style="color: #98be65;">"B"</span>, <span style="color: #da8548; font-weight: bold;">100</span>, <span style="color: #da8548; font-weight: bold;">100</span><span style="color: #98be65;">)</span>;

        <span style="color: #5B6268;">// </span><span style="color: #5B6268;">&#1054;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1077;&#1085;&#1080;&#1077; &#1084;&#1072;&#1089;&#1089;&#1080;&#1074;&#1072; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1086;&#1074; &#1080;&#1079; 100 &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074;</span>
        <span style="color: #ECBE7B;">Point</span><span style="color: #98be65;">[]</span> <span style="color: #dcaeea;">points</span> = <span style="color: #51afef;">new</span> <span style="color: #ECBE7B;">Point</span><span style="color: #98be65;">[</span><span style="color: #da8548; font-weight: bold;">100</span><span style="color: #98be65;">]</span>;
        <span style="color: #5B6268;">//      </span><span style="color: #5B6268;">~~~~~~ - &#1080;&#1084;&#1103; &#1084;&#1072;&#1089;&#1089;&#1080;&#1074;&#1072; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1086;&#1074;</span>
        points<span style="color: #98be65;">[</span><span style="color: #da8548; font-weight: bold;">0</span><span style="color: #98be65;">]</span> = <span style="color: #51afef;">new</span> <span style="color: #ECBE7B;">Point</span><span style="color: #98be65;">(</span><span style="color: #98be65;">"AA"</span>, <span style="color: #da8548; font-weight: bold;">2</span>, <span style="color: #da8548; font-weight: bold;">1</span><span style="color: #98be65;">)</span>;
        points<span style="color: #98be65;">[</span><span style="color: #da8548; font-weight: bold;">1</span><span style="color: #98be65;">]</span> = <span style="color: #51afef;">new</span> <span style="color: #ECBE7B;">Point</span><span style="color: #98be65;">(</span><span style="color: #98be65;">"BB"</span>, <span style="color: #da8548; font-weight: bold;">34</span>, <span style="color: #da8548; font-weight: bold;">48</span><span style="color: #98be65;">)</span>;
        <span style="color: #5B6268;">// </span><span style="color: #5B6268;">...</span>
    <span style="color: #c678dd;">}</span>
<span style="color: #51afef;">}</span>;
</pre>
</div>

<p>
<i>Замечание</i>: если в объявлении класса содержится несколько статических блоков,
то код в них выполняется последовательно.
</p>

<p>
<i>Замечание</i>: совокупность всех <code>static</code>-блоков играет роль статического
конструктора.
</p>
</div>
</div>

<div id="outline-container-org5f62a3e" class="outline-3">
<h3 id="org5f62a3e"><span class="section-number-3">3.3.</span> Перегрузка методов</h3>
<div class="outline-text-3" id="text-3-3">
<p>
<b>Сигнатура метода (method signature)</b> &#x2014; информация о количестве и типах
формальных параметров в методе.
</p>

<p>
<i>Замечание</i>: если у метода нет формальных параметров, то говорят, что у метода
пустая сигнатура.
</p>

<p>
<b>Перегрузка метода (method overloading)</b> &#x2014; это объявление для заданного класса
двух или более методов, имеющих одинаковое имя, но различные сигнатуры.
</p>

<p>
<i>Замечание</i>: решение о том, куда передается управление при вызове перегруженного
метода X, принимается на этапе компиляции на основе сопоставления типов
фактических параметров вызываемого метода и сигнатуры, имеющей имя X.
</p>
</div>
</div>

<div id="outline-container-orgbc9d090" class="outline-3">
<h3 id="orgbc9d090"><span class="section-number-3">3.4.</span> Виртуальные методы</h3>
<div class="outline-text-3" id="text-3-4">
<p>
<b>Раннее связывание (early binding)</b> &#x2014; определение адреса вызываемого
экземлярного метода во время компиляции программы.
</p>

<p>
<b>Позднее связывание (late binding)</b> &#x2014; определение адреса вызываемого
экземлярного метода на основе информации о классе объекта во время выполнения
программы.
</p>

<p>
<b>Виртуальные экземплярные методы</b> &#x2013; экземплярные методы, для вызова которых
выполняется позднее связывание называются <b>виртуальными</b>.
</p>

<p>
<i>Замечание</i>: в языке <code>Java</code> все методы являются <b>виртуальными</b>.
</p>

<p>
<i>Выводы</i>:
</p>
<ol class="org-ol">
<li>Все методы в <code>Java</code> виртуальные, следовательно, для любых методов выполняется
позднее связывание.</li>
<li>В <code>Java</code> метод класса может быть определен в классах-наследниках так, что
конкретная реализация метода для вызова будет определяться во время
исполнения.</li>
<li>Таким образом, программисту не обязательно знать точный тип объекта для
работы с ним через виртуальные методы: достаточно знать, что объект
принадлежит классу или наследнику класса, в котором объявлен метод.</li>
</ol>
</div>
</div>

<div id="outline-container-org7b04735" class="outline-3">
<h3 id="org7b04735"><span class="section-number-3">3.5.</span> Перегрузка экземплярного конструктора</h3>
<div class="outline-text-3" id="text-3-5">
<p>
<b>Экземплярный конструктор (instance constructor)</b> &#x2014; экземплярный метод,
предназначенный для инициализации только что созданного объекта.
</p>

<p>
<i>Замечание</i>: в <code>Java</code> и других объектно-ориентированных языках программирования
операция создания объекта объединена с вызовом конструктора, что гарантирует
отсутствие неинициализированных объектов.
</p>

<p>
<i>Замечание</i>: перегрузка конструктора осуществляется аналогично перегрузке
методов, поскольку конструктор это такой же метод.
</p>

<p>
<b>Конструктор по умолчанию (default constructor)</b> &#x2014; экземплярный конструктор с
пустой сигнатурой.
</p>

<p>
<i>Замечание</i>: во всех языка программирования конструктор по умолчанию всегда
создается даже если для класса не определен ни один конструктор.
</p>

<p>
<b>Статический конструктор (static constructor)</b> &#x2014; статический метод,
предназначенный для инициализации статических полей класса. Статический
конструктор не имеет параметров и вызывается до вызова любого статического
метода или конструктора класса.
</p>

<p>
<i>Замечание</i>: в <code>Java</code> нет статических конструкторов, т.к. конструктор по
определению не может быть статическим. Не может существовать конструктора для
класса, т.к. класс не является его экземпляром.
</p>
</div>
</div>
</div>
<div id="outline-container-org496b809" class="outline-2">
<h2 id="org496b809"><span class="section-number-2">4.</span> Наследование, субтипизация</h2>
<div class="outline-text-2" id="text-4">
</div>
