lectures/lectures.org
** Понятие субтипизации
Пусть тип данных ~A~ является *подтипом (subtype)* для типа данных
~B~, тогда программный код, который рассчитан на обработку значений типа
~B~, может быть корректно использован для обработки значений типа ~A~.

/Пример/:
#+begin_src java
for (int i = 0; i < 10; i++) {}
for (double i = 0; i < 10; i++) {}
#+end_src
В данном случае, пример программного кода рассчитанный на обработку значений
типа ~double~, также предназначен для обработки значений типа ~int~.

*Субтипизация (subtyping)* --- это свойство языка программирования, означающее
возможность использования подтипа в программе.

/Замечание/: для личного понимания субтипизации можно рассматривать *типы
данных* как *множества значений*, тогда тип ~A~ является подтипом для
~B~ означает ~B~ подмножество ~A~.

/Замечание/: семантика языков программирования, поддерживающих субтипизацию и
ориентированных на статическую проверку допускает, что одно значение может иметь
сразу несколько типов.

** Явная и неявная типизация
*Неявная типизация* --- выбор типа на основе анализа структуры значения. (или выведение типа в статически типизированных языках)

*Явная типизация* --- тип указывается программистом явно.
(Используется в ~Java~)

** Наследование как механизм явной субтипизации
*Наследование (inheritance)* --- это способ получения нового класса на основе
уже существующего класса, сочетающего усложнение внутреннего состояния
объектов, расширение интерфейса обробатывающего сообщения и изначальные реакции
на некоторые из них.

Если класс ~B~ наследуется от класса ~A~, то
~A~ --- *базовый класс (base class, superclass)*,
~B~ --- *производный класс (derived subclass)*.

/Замечание/: при наследовании производный класс получает все экземплярные поля
базового класса и все экземплярные методы, кроме конструкторов.

/Замечание/: тело любого конструктора производного класса должно начинаться с
вызова одного из конструкторов базового класса.

*Множественное наследование* --- производный класс может иметь более одного базового класса.

~Java~, ~C#~ не поддерживают множественное наследование.
~C++~, ~Python~, ~Perl6~ --- поддерживают.

** Абстрактные классы и интерфейсы
Альтернативой множественному наследованию в ~Java~ являются:
- *Абстрактные классы*
- *Интерфейсы*

/Пример/:
#+begin_src java
class ПроизводныйКласс extends БазовыйКласс {
    ...
}
#+end_src

/Замечание/: по умолчанию любой класс в ~Java~ является наследником встроенного
класса ~Object~.

/Замечание/: примеры методов класса ~Object~: ~clone()~, ~toString()~, ...

/Замечание/: если конструктор базового класса является конструктором по
умолчанию, то его вызов добавляется компилятором ~Java~ в конструктор
производного класса автоматически. В противном случае необходимо явно вызвать
конструктор базового класса в конструкторе производного класса.

/Пример/:
#+begin_src java
class Animal {
    private String species;
    public Animal(String species) {
        this.species = species;
    }
};

class Dog extents Animal {
    private String breed;
    public Dog(String breed) {
        super("Sobaka");
        this.breed = breed;
    }
};
#+end_src

** Неявное и явное приведение типов
/Замечание/: *неявное* приведение типов происходит тогда, когда два типа
автоматически конвертируются.

/Замечание/: *неявное* приведение типов возможно, когда два типа данных
совместимы. А также, когда мы присваиваем значение меньшего типа к большему.

/Замечание/: ~char~ и ~boolean~ несовместимы.

/Замечание/: числовые типы данных совместимы друг с другом. Например ~int~ и
~double~.
