lectures/lectures.html
<div id="outline-container-orge955214" class="outline-3">
<h3 id="orge955214"><span class="section-number-3">4.1.</span> Понятие субтипизации</h3>
<div class="outline-text-3" id="text-4-1">
<p>
Пусть тип данных <code>A</code> является <b>подтипом (subtype)</b> для типа данных
<code>B</code>, тогда программный код, который рассчитан на обработку значений типа
<code>B</code>, может быть корректно использован для обработки значений типа <code>A</code>.
</p>

<p>
<i>Пример</i>:
</p>
<div class="org-src-container">
<pre class="src src-java"><span style="color: #51afef;">for</span> <span style="color: #51afef;">(</span><span style="color: #ECBE7B;">int</span> <span style="color: #dcaeea;">i</span> = <span style="color: #da8548; font-weight: bold;">0</span>; i &lt; <span style="color: #da8548; font-weight: bold;">10</span>; i++<span style="color: #51afef;">)</span> <span style="color: #51afef;">{}</span>
<span style="color: #51afef;">for</span> <span style="color: #51afef;">(</span><span style="color: #ECBE7B;">double</span> <span style="color: #dcaeea;">i</span> = <span style="color: #da8548; font-weight: bold;">0</span>; i &lt; <span style="color: #da8548; font-weight: bold;">10</span>; i++<span style="color: #51afef;">)</span> <span style="color: #51afef;">{}</span>
</pre>
</div>
<p>
В данном случае, пример программного кода рассчитанный на обработку значений
типа <code>double</code>, также предназначен для обработки значений типа <code>int</code>.
</p>

<p>
<b>Субтипизация (subtyping)</b> &#x2014; это свойство языка программирования, означающее
возможность использования подтипа в программе.
</p>

<p>
<i>Замечание</i>: для личного понимания субтипизации можно рассматривать <b>типы
данных</b> как <b>множества значений</b>, тогда тип <code>A</code> является подтипом для
<code>B</code> означает <code>B</code> подмножество <code>A</code>.
</p>

<p>
<i>Замечание</i>: семантика языков программирования, поддерживающих субтипизацию и
ориентированных на статическую проверку допускает, что одно значение может иметь
сразу несколько типов.
</p>
</div>
</div>

<div id="outline-container-orgd6c7ec3" class="outline-3">
<h3 id="orgd6c7ec3"><span class="section-number-3">4.2.</span> Явная и неявная типизация</h3>
<div class="outline-text-3" id="text-4-2">
<p>
<b>Неявная типизация</b> &#x2014; выбор типа на основе анализа структуры значения. (или выведение типа в статически типизированных языках)
</p>

<p>
<b>Явная типизация</b> &#x2014; тип указывается программистом явно.
(Используется в <code>Java</code>)
</p>
</div>
</div>

<div id="outline-container-orgdcc6e4f" class="outline-3">
<h3 id="orgdcc6e4f"><span class="section-number-3">4.3.</span> Наследование как механизм явной субтипизации</h3>
<div class="outline-text-3" id="text-4-3">
<p>
<b>Наследование (inheritance)</b> &#x2014; это способ получения нового класса на основе
уже существующего класса, сочетающего усложнение внутреннего состояния
объектов, расширение интерфейса обробатывающего сообщения и изначальные реакции
на некоторые из них.
</p>

<p>
Если класс <code>B</code> наследуется от класса <code>A</code>, то
<code>A</code> &#x2014; <b>базовый класс (base class, superclass)</b>,
<code>B</code> &#x2014; <b>производный класс (derived subclass)</b>.
</p>

<p>
<i>Замечание</i>: при наследовании производный класс получает все экземплярные поля
базового класса и все экземплярные методы, кроме конструкторов.
</p>

<p>
<i>Замечание</i>: тело любого конструктора производного класса должно начинаться с
вызова одного из конструкторов базового класса.
</p>

<p>
<b>Множественное наследование</b> &#x2014; производный класс может иметь более одного базового класса.
</p>

<p>
<code>Java</code>, <code>C#</code> не поддерживают множественное наследование.
<code>C++</code>, <code>Python</code>, <code>Perl6</code> &#x2014; поддерживают.
</p>
</div>
</div>

<div id="outline-container-org335b614" class="outline-3">
<h3 id="org335b614"><span class="section-number-3">4.4.</span> Абстрактные классы и интерфейсы</h3>
<div class="outline-text-3" id="text-4-4">
<p>
Альтернативой множественному наследованию в <code>Java</code> являются:
</p>
<ul class="org-ul">
<li><b>Абстрактные классы</b></li>
<li><b>Интерфейсы</b></li>
</ul>

<p>
<i>Пример</i>:
</p>
<div class="org-src-container">
<pre class="src src-java"><span style="color: #51afef;">class</span> <span style="color: #ECBE7B;">&#1055;&#1088;&#1086;&#1080;&#1079;&#1074;&#1086;&#1076;&#1085;&#1099;&#1081;&#1050;&#1083;&#1072;&#1089;&#1089;</span> <span style="color: #51afef;">extends</span> <span style="color: #ECBE7B;">&#1041;&#1072;&#1079;&#1086;&#1074;&#1099;&#1081;&#1050;&#1083;&#1072;&#1089;&#1089;</span> <span style="color: #51afef;">{</span>
    ...
<span style="color: #51afef;">}</span>
</pre>
</div>

<p>
<i>Замечание</i>: по умолчанию любой класс в <code>Java</code> является наследником встроенного
класса <code>Object</code>.
</p>

<p>
<i>Замечание</i>: примеры методов класса <code>Object</code>: <code>clone()</code>, <code>toString()</code>, &#x2026;
</p>

<p>
<i>Замечание</i>: если конструктор базового класса является конструктором по
умолчанию, то его вызов добавляется компилятором <code>Java</code> в конструктор
производного класса автоматически. В противном случае необходимо явно вызвать
конструктор базового класса в конструкторе производного класса.
</p>

<p>
<i>Пример</i>:
</p>
<div class="org-src-container">
<pre class="src src-java"><span style="color: #51afef;">class</span> <span style="color: #ECBE7B;">Animal</span> <span style="color: #51afef;">{</span>
    <span style="color: #51afef;">private</span> <span style="color: #ECBE7B;">String</span> <span style="color: #dcaeea;">species</span>;
    <span style="color: #51afef;">public</span> <span style="color: #c678dd;">Animal</span><span style="color: #c678dd;">(</span><span style="color: #ECBE7B;">String</span> <span style="color: #dcaeea;">species</span><span style="color: #c678dd;">)</span> <span style="color: #c678dd;">{</span>
        <span style="color: #51afef;">this</span>.species = species;
    <span style="color: #c678dd;">}</span>
<span style="color: #51afef;">}</span>;

<span style="color: #51afef;">class</span> Dog <span style="color: #ECBE7B;">extents</span> <span style="color: #ECBE7B;">Animal</span> <span style="color: #51afef;">{</span>
    <span style="color: #51afef;">private</span> <span style="color: #ECBE7B;">String</span> <span style="color: #dcaeea;">breed</span>;
    <span style="color: #51afef;">public</span> <span style="color: #c678dd;">Dog</span><span style="color: #c678dd;">(</span><span style="color: #ECBE7B;">String</span> <span style="color: #dcaeea;">breed</span><span style="color: #c678dd;">)</span> <span style="color: #c678dd;">{</span>
        <span style="color: #51afef;">super</span><span style="color: #98be65;">(</span><span style="color: #98be65;">"Sobaka"</span><span style="color: #98be65;">)</span>;
        <span style="color: #51afef;">this</span>.breed = breed;
    <span style="color: #c678dd;">}</span>
<span style="color: #51afef;">}</span>;
</pre>
</div>
</div>
</div>

<div id="outline-container-org760e8ad" class="outline-3">
<h3 id="org760e8ad"><span class="section-number-3">4.5.</span> Неявное и явное приведение типов</h3>
<div class="outline-text-3" id="text-4-5">
<p>
<i>Замечание</i>: <b>неявное</b> приведение типов происходит тогда, когда два типа
автоматически конвертируются.
</p>

<p>
<i>Замечание</i>: <b>неявное</b> приведение типов возможно, когда два типа данных
совместимы. А также, когда мы присваиваем значение меньшего типа к большему.
</p>

<p>
<i>Замечание</i>: <code>char</code> и <code>boolean</code> несовместимы.
</p>

<p>
<i>Замечание</i>: числовые типы данных совместимы друг с другом. Например <code>int</code> и
<code>double</code>.
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Starovoytov Alexandr</p>
<p class="date">Created: 2022-03-06 Sun 00:14</p>
</div>
</body>
</html>
